cf/InformationRegisters/ProductsCodesPeripheralOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ProductsCodesPeripheralOffline</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExchangeRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithPeripheralsOfflineRules</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/PeripheralTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>PeripheralTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BarCodeScanner</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MagneticCardReader</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FiscalRegister</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDisplay</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataCollectionTerminal</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POSTerminal</Name>
					<Comment>POSTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ElectronicScales</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LabelsPrintingScales</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashRegistersOffline</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/RetailReport.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>RetailReport</Name>
			<BasedOn>
				<xr:Item>Document.InventoryReconciliation</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashInCashRegisters</xr:Item>
				<xr:Item>AccumulationRegister.Sales</xr:Item>
				<xr:Item>AccumulationRegister.SalesByDiscountCards</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpensesCashMethod</xr:Item>
				<xr:Item>AccumulationRegister.InventoryInWarehouses</xr:Item>
				<xr:Item>AccountingRegister.Managerial</xr:Item>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.InventoryReceived</xr:Item>
				<xr:Item>AccumulationRegister.AutomaticDiscountsApplied</xr:Item>
				<xr:Item>AccumulationRegister.IncomeAndExpenses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InventoryReconciliation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryReconciliation</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCRSessionStart</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCRSessionEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashCRSessionStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashCRSessionStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATTaxation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATTaxationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountIncludesVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeVATInPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Item</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MarkupAndDiscountKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PositionResponsible</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AttributePositionOnForm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Performer</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Responsible</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountCard</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountsPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PaymentWithPaymentCards</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>POSTerminal</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.POSTerminals</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ChargeCardKind</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ChargeCardNo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountsMarkups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DiscountMarkup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AutomaticDiscounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonForms/ExchangeWithPeripheralsOffline/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

&AtServer
Procedure AssignRuleForHighlitedDevicesAtServer(Device, ExchangeRule)
	
	SetPrivilegedMode(True);
	
	BeginTransaction();
	
	For Each Device IN Device Do
		
		DeviceObject = Device.GetObject();
		DeviceObject.ExchangeRule = ExchangeRule;
		DeviceObject.Write();
		
	EndDo;
	
	CommitTransaction();
	
EndProcedure

&AtServer
Function GetReportAboutRetailSalesByPettyCash(CashCR, ImportDate)
	
	Report = Undefined;
	
	Query = New Query(
	"SELECT TOP 1
	|	RetailReport.Ref AS Report
	|FROM
	|	Document.RetailReport AS RetailReport
	|WHERE
	|	RetailReport.CashCR = &CashCR
	|	AND RetailReport.Date between &StartDate AND &EndDate");
	
	Query.SetParameter("CashCR", CashCR);
	Query.SetParameter("StartDate",    ImportDate - 5);
	Query.SetParameter("EndDate", ImportDate + 5);
	
	Result = Query.Execute();
	Selection = Result.Select();
	
	If Selection.Next() Then
		Report = Selection.Report;
	EndIf;
	
	Return Report;
	
EndFunction

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Workplace = EquipmentManagerServerCall.GetClientWorkplace();
	
	Scales.Parameters.SetParameterValue("CurrentWorksPlace", Workplace);
	CashRegisters.Parameters.SetParameterValue("CurrentWorksPlace", Workplace);
	
EndProcedure

&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	WarehouseCROffline = Settings.Get("WarehouseCROffline");
	WarehouseScales = Settings.Get("WarehouseScales");
	
	ExchangeRuleScales = Settings.Get("ExchangeRuleScales");
	CROfflineExchangeRule = Settings.Get("CROfflineExchangeRule");
	
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "Warehouse", WarehouseCROffline, DataCompositionComparisonType.Equal,, ValueIsFilled(WarehouseCROffline));
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "ExchangeRule", CROfflineExchangeRule, DataCompositionComparisonType.Equal,, ValueIsFilled(CROfflineExchangeRule));
	CommonUseClientServer.SetFilterItem(Scales.Filter, "Warehouse", WarehouseScales, DataCompositionComparisonType.Equal,, ValueIsFilled(WarehouseScales));
	CommonUseClientServer.SetFilterItem(Scales.Filter, "ExchangeRule", ExchangeRuleScales, DataCompositionComparisonType.Equal,, ValueIsFilled(ExchangeRuleScales));
	
	CommonUseClientServer.SetFilterItem(Scales.Filter, "ConnectedToCurrentWorksplace", True, DataCompositionComparisonType.Equal,, AllEquipmentScales = False);
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "ConnectedToCurrentWorksplace", True, DataCompositionComparisonType.Equal,, AllEquipmentCROffline = False);
	
EndProcedure // OnLoadDataFromSettingsAtServer()

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "CurrentSessionWorkplaceChanged" Then
		
		Workplace = EquipmentManagerServerCall.GetClientWorkplace();
		
		Scales.Parameters.SetParameterValue("CurrentWorksPlace", Workplace);
		CashRegisters.Parameters.SetParameterValue("CurrentWorksPlace", Workplace);
		
	ElsIf EventName = "Writing_ExchangeRulesWithPeripheralsOffline"
		OR EventName = "Record_CodesOfGoodsPeripheral" Then
		
		Items.Scales.Refresh();
		Items.CashRegisters.Refresh();
		
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - COMMAND HANDLERS

&AtClient
Procedure ScalesViewProductsList(Command)
	
	CurrentData = Items.Scales.CurrentData;
	If CurrentData <> Undefined AND ValueIsFilled(CurrentData.ExchangeRule) Then
		
		FormParameters = New Structure("Device, ExchangeRule", CurrentData.Peripherals, CurrentData.ExchangeRule);
		OpenForm("InformationRegister.ProductsCodesPeripheralOffline.Form.ProductsList", FormParameters, UUID);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ScalesSetRuleForSelected(Command)
	
	Device = New Array;
	For Each SelectedRow IN Items.Scales.SelectedRows Do
		Device.Add(SelectedRow);
	EndDo;
	
	If Device.Count() > 0 Then
		
		OpenParameters = New Structure;
		OpenParameters.Insert("PeripheralsType", PredefinedValue("Enum.PeripheralTypes.LabelsPrintingScales"));
		Notification = New NotifyDescription("ScalesSetRuleForSelectedCompletion",ThisForm,Device);
		OpenForm("Catalog.ExchangeWithPeripheralsOfflineRules.ChoiceForm", OpenParameters, UUID,,,,Notification);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ScalesSetRuleForSelectedCompletion(ExchangeRule,Device) Export
	
	If ValueIsFilled(ExchangeRule) Then
		AssignRuleForHighlitedDevicesAtServer(Device, ExchangeRule);
	EndIf;
		
	Items.Scales.Refresh();
	
EndProcedure

&AtClient
Procedure ScalesProductsExport(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"ScalesProductsExchangeScalesOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousExportProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.LabelsPrintingScales"), Items.Scales.SelectedRows,,, NotificationOnImplementation, True);
	
EndProcedure

&AtClient
Procedure ScalesProductsExchangeScalesOfflineEnd(Result, Parameters) Export
	
	If Result Then
		Items.Scales.Refresh();
	EndIf;
	
EndProcedure

&AtClient
Procedure ScalesProductsClear(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"ScalesProductsExchangeScalesOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousClearProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.LabelsPrintingScales"), Items.Scales.SelectedRows,,, NotificationOnImplementation);
	
EndProcedure

&AtClient
Procedure ScalesProductsReload(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"ScalesProductsExchangeScalesOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousExportProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.LabelsPrintingScales"), Items.Scales.SelectedRows,,, NotificationOnImplementation, False);
	
EndProcedure

&AtClient
Procedure CashesViewProductList(Command)
	
	CurrentData = Items.CashRegisters.CurrentData;
	If CurrentData <> Undefined AND ValueIsFilled(CurrentData.ExchangeRule) Then
		
		FormParameters = New Structure("Device, ExchangeRule", CurrentData.Peripherals, CurrentData.ExchangeRule);
		OpenForm("InformationRegister.ProductsCodesPeripheralOffline.Form.ProductsList", FormParameters, UUID);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PettyCashesSetRuleForSelected(Command)
	
	Device = New Array;
	For Each SelectedRow IN Items.CashRegisters.SelectedRows Do
		Device.Add(SelectedRow);
	EndDo;
	
	If Device.Count() > 0 Then
		
		OpenParameters = New Structure;
		OpenParameters.Insert("PeripheralsType", PredefinedValue("Enum.PeripheralTypes.CashRegistersOffline"));
		Notification = New NotifyDescription("PettyCashesSetRuleForSelectedCompletion",ThisForm,Device);
		OpenForm("Catalog.ExchangeWithPeripheralsOfflineRules.ChoiceForm", OpenParameters, UUID,,,,Notification);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PettyCashesSetRuleForSelectedCompletion(ExchangeRule,Device) Export
	
	If ValueIsFilled(ExchangeRule) Then
		AssignRuleForHighlitedDevicesAtServer(Device, ExchangeRule);
	EndIf;
		
	Items.CashRegisters.Refresh();
	
EndProcedure

&AtClient
Procedure PettyCashesProductsExport(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"PettyCashesProductsExchangeWithCashRegisterOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousExportProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.CashRegistersOffline"), Items.CashRegisters.SelectedRows,,, NotificationOnImplementation, True);
	
EndProcedure

&AtClient
Procedure PettyCashesProductsExchangeWithCashRegisterOfflineEnd(Result, Parameters) Export
	
	If Result Then
		Items.CashRegisters.Refresh();
	EndIf;
	
EndProcedure

&AtClient
Procedure PettyCashesProductsClear(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"PettyCashesProductsExchangeWithCashRegisterOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousClearProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.CashRegistersOffline"), Items.CashRegisters.SelectedRows,,, NotificationOnImplementation);
	
EndProcedure

&AtClient
Procedure PettyCashesProductsReload(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"PettyCashesProductsExchangeWithCashRegisterOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousExportProductsInEquipmentOffline(PredefinedValue("Enum.PeripheralTypes.CashRegistersOffline"), Items.CashRegisters.SelectedRows,,, NotificationOnImplementation, False);
	
EndProcedure

&AtClient
Procedure PettyCashesGoodsIImportReportAboutRetailSales(Command)
	
	NotificationOnImplementation = New NotifyDescription(
		"PettyCashesProductsExchangeWithCashRegisterOfflineEnd",
		ThisObject
	);
	
	PeripheralsOfflineClient.AsynchronousImportReportAboutRetailSales(Items.CashRegisters.SelectedRows,,, NotificationOnImplementation);
	
EndProcedure

&AtClient
Procedure ScalesOpenExchangeRule(Command)
	
	CurrentData = Items.Scales.CurrentData;
	If CurrentData <> Undefined AND ValueIsFilled(CurrentData.ExchangeRule) Then
		
		ShowValue(Undefined,CurrentData.ExchangeRule);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PettyCashesOpenExchangeRule(Command)
	
	CurrentData = Items.CashRegisters.CurrentData;
	If CurrentData <> Undefined AND ValueIsFilled(CurrentData.ExchangeRule) Then
		
		ShowValue(Undefined,CurrentData.ExchangeRule);
		
	Else
		
		ShowMessageBox(Undefined,NStr("en='Command can not be executed for the specified object';ru='Команда не может быть выполнена для указанного объекта!'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure AutomaticExchange(Command)
	
	FormParameters = New Structure("Workplace", Workplace);
	OpenForm("CommonForm.AutomaticExchangeWithPeripheralsOffline", FormParameters);
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM ITEMS EVENTS HANDLERS

&AtClient
Procedure WarehouseScalesOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(Scales.Filter, "Warehouse", WarehouseScales, DataCompositionComparisonType.Equal,, ValueIsFilled(WarehouseScales));
	
EndProcedure

&AtClient
Procedure ExchangeRuleScalesOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(Scales.Filter, "ExchangeRule", ExchangeRuleScales, DataCompositionComparisonType.Equal,, ValueIsFilled(ExchangeRuleScales));
	
EndProcedure

&AtClient
Procedure WarehouseCashRegisterOfflineOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "Warehouse", WarehouseCROffline, DataCompositionComparisonType.Equal,, ValueIsFilled(WarehouseCROffline));
	
EndProcedure

&AtClient
Procedure ExchangeRuleCashRegisterOfflineOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "ExchangeRule", CROfflineExchangeRule, DataCompositionComparisonType.Equal,, ValueIsFilled(CROfflineExchangeRule));
	
EndProcedure

&AtClient
Procedure EquipmentCashRegisterOfflineOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(CashRegisters.Filter, "ConnectedToCurrentWorksplace", True, DataCompositionComparisonType.Equal,, AllEquipmentCROffline = False);
	
EndProcedure

&AtClient
Procedure EquipmentScalesOnChange(Item)
	
	CommonUseClientServer.SetFilterItem(Scales.Filter, "ConnectedToCurrentWorksplace", True, DataCompositionComparisonType.Equal,, AllEquipmentScales = False);
	
EndProcedure

&AtClient
Procedure CashRegistersChoice(Item, SelectedRow, Field, StandardProcessing)
	
	CurrentData = Item.CurrentData;
	
	If Field = Items.CashRegistersImportDate AND ValueIsFilled(CurrentData.ImportDate) Then
		StandardProcessing = False;
		Report = GetReportAboutRetailSalesByPettyCash(CurrentData.CashCR, CurrentData.ImportDate);
		
		If ValueIsFilled(Report) Then
			ShowValue(Undefined,Report);
		Else
			ShowMessageBox(Undefined,NStr("en='Retail sales report is not found.';ru='Отчет о розничных продажах не найден.'"));
		EndIf;
		
	EndIf;
	
EndProcedure
